uhnp/src/InformationRegisters/СостоянияПлановыхКалькуляций/СостоянияПлановыхКалькуляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПлановыхКалькуляций</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРасчетаПлановойКалькуляции</types>
    </type>
  </resources>
  <dimensions>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.ПлановаяКалькуляция2_2</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияПлановыхКалькуляций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Записывает состояние калькуляции.
// Параметры:
//	Калькуляция - ДокументСсылка.ПлановаяКалькуляция2_2 - калькуляция по которой необходимо установить статус.
//	Состояние - ПеречислениеСсылка.СостоянияРасчетаПлановойКалькуляции - новое состояние.
//
Процедура УстановитьСостояние(Калькуляция, Состояние) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостоянияПлановыхКалькуляций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Калькуляция.Установить(Калькуляция);
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Калькуляция = Калькуляция;
		НоваяЗапись.Состояние = Состояние;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
